; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v13 ?v8)
             (pred_1 ?v1 ?v4)
             (pred_3 ?v13 ?v4)
             (pred_2 ?v10 ?v13 )
	     (pred_4 ?v13)
             (pred_6 ?v6)
             (pred_10 ?v1)
             (pred_12 ?v4)
             (pred_9 ?v13)
             (pred_8 ?v1)
             (pred_11 ?v13)
             (pred_7 ))



(:action op_1
:parameters (?v12 ?v7 ?v2 ?v11)
:precondition (and (pred_6 ?v12) (pred_6 ?v7) (pred_10 ?v2) (pred_12 ?v11)
          (pred_5 ?v12 ?v7) (pred_1 ?v2 ?v11)
                   (pred_3 ?v7 ?v11) (pred_4 ?v12) 
                   (pred_9 ?v7) (pred_8 ?v2))
:effect (and  (pred_11 ?v7) (not (pred_9 ?v7))))


(:action op_2
:parameters (?v12 ?v3)
:precondition (and (pred_6 ?v12) (pred_6 ?v3)
               (pred_4 ?v12) (pred_5 ?v12 ?v3) (pred_11 ?v3))
:effect (and (pred_4 ?v3) (not (pred_4 ?v12))))

(:action op_3
:parameters (?v12 ?v2)
:precondition (and (pred_6 ?v12) (pred_10 ?v2) 
                  (pred_4 ?v12) (pred_2 ?v2 ?v12) (pred_7 ))
:effect (and (pred_8 ?v2)
   (not (pred_2 ?v2 ?v12)) (not (pred_7 ))))


(:action op_4
:parameters (?v12 ?v5 ?v9)
:precondition (and (pred_6 ?v12) (pred_10 ?v5) (pred_10 ?v9)
                  (pred_4 ?v12) (pred_8 ?v9) (pred_2 ?v5 ?v12))
:effect (and (pred_8 ?v5) (pred_2 ?v9 ?v12)
        (not (pred_8 ?v9)) (not (pred_2 ?v5 ?v12))))

(:action op_5
:parameters (?v12 ?v2)
:precondition (and (pred_6 ?v12) (pred_10 ?v2) 
                  (pred_4 ?v12) (pred_8 ?v2))
:effect (and (pred_7 ) (pred_2 ?v2 ?v12) (not (pred_8 ?v2)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_20 obj_08 obj_11 obj_05 obj_13 obj_18 obj_09 obj_07 obj_19 obj_10 obj_01 obj_15 obj_14 obj_04 obj_06 obj_17
    obj_21 obj_03
    obj_02 obj_16 obj_12
    )

    (:init
       (pred_7)

       (pred_6 obj_20)
       (pred_6 obj_08)
       (pred_6 obj_11)
       (pred_6 obj_05)
       (pred_6 obj_13)
       (pred_6 obj_18)
       (pred_6 obj_09)
       (pred_6 obj_07)
       (pred_6 obj_19)
       (pred_6 obj_10)
       (pred_6 obj_01)
       (pred_6 obj_15)
       (pred_6 obj_14)
       (pred_6 obj_04)
       (pred_6 obj_06)
       (pred_6 obj_17)
       (pred_12 obj_21)
       (pred_12 obj_03)
       (pred_10 obj_02)
       (pred_10 obj_16)
       (pred_10 obj_12)

       (pred_5 obj_20 obj_13)
       (pred_5 obj_20 obj_08)
       (pred_5 obj_08 obj_18)
       (pred_5 obj_08 obj_11)
       (pred_5 obj_08 obj_20)
       (pred_5 obj_11 obj_09)
       (pred_5 obj_11 obj_05)
       (pred_5 obj_11 obj_08)
       (pred_5 obj_05 obj_07)
       (pred_5 obj_05 obj_11)
       (pred_5 obj_13 obj_19)
       (pred_5 obj_13 obj_18)
       (pred_5 obj_13 obj_20)
       (pred_5 obj_18 obj_10)
       (pred_5 obj_18 obj_09)
       (pred_5 obj_18 obj_08)
       (pred_5 obj_18 obj_13)
       (pred_5 obj_09 obj_01)
       (pred_5 obj_09 obj_07)
       (pred_5 obj_09 obj_11)
       (pred_5 obj_09 obj_18)
       (pred_5 obj_07 obj_15)
       (pred_5 obj_07 obj_05)
       (pred_5 obj_07 obj_09)
       (pred_5 obj_19 obj_14)
       (pred_5 obj_19 obj_10)
       (pred_5 obj_19 obj_13)
       (pred_5 obj_10 obj_04)
       (pred_5 obj_10 obj_01)
       (pred_5 obj_10 obj_18)
       (pred_5 obj_10 obj_19)
       (pred_5 obj_01 obj_06)
       (pred_5 obj_01 obj_15)
       (pred_5 obj_01 obj_09)
       (pred_5 obj_01 obj_10)
       (pred_5 obj_15 obj_17)
       (pred_5 obj_15 obj_07)
       (pred_5 obj_15 obj_01)
       (pred_5 obj_14 obj_04)
       (pred_5 obj_14 obj_19)
       (pred_5 obj_04 obj_06)
       (pred_5 obj_04 obj_10)
       (pred_5 obj_04 obj_14)
       (pred_5 obj_06 obj_17)
       (pred_5 obj_06 obj_01)
       (pred_5 obj_06 obj_04)
       (pred_5 obj_17 obj_15)
       (pred_5 obj_17 obj_06)
       (pred_9 obj_19)
       (pred_9 obj_04)
       (pred_9 obj_07)
       (pred_3  obj_19 obj_21)
       (pred_3  obj_04 obj_03)
       (pred_3  obj_07 obj_21)
       (pred_11 obj_20)
       (pred_11 obj_08)
       (pred_11 obj_11)
       (pred_11 obj_05)
       (pred_11 obj_13)
       (pred_11 obj_18)
       (pred_11 obj_09)
       (pred_11 obj_10)
       (pred_11 obj_01)
       (pred_11 obj_15)
       (pred_11 obj_14)
       (pred_11 obj_06)
       (pred_11 obj_17)

       (pred_1  obj_02 obj_21)
       (pred_1  obj_16 obj_03)
       (pred_1  obj_12 obj_21)
       (pred_2 obj_02 obj_08)
       (pred_2 obj_16 obj_18)
       (pred_2 obj_12 obj_07)
       (pred_4 obj_09)
    )

    (:goal (and
       (pred_2 obj_02 obj_07)
    ))
(:constraints
  (always (not (pred_4 obj_11)))
)
)

; plan
1. (op_2 obj_09 obj_18)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_18)
   goals met: 0 of 1
2. (op_2 obj_18 obj_08)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_08)
   goals met: 0 of 1
3. (op_3 obj_08 obj_02)
   deleted: (pred_2 obj_02 obj_08) (pred_7)
   added: (pred_8 obj_02)
   goals met: 0 of 1
4. (op_2 obj_08 obj_18)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_18)
   goals met: 0 of 1
5. (op_2 obj_18 obj_09)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_09)
   goals met: 0 of 1
6. (op_1 obj_09 obj_07 obj_02 obj_21)
   deleted: (pred_9 obj_07)
   added: (pred_11 obj_07)
   goals met: 0 of 1
7. (op_2 obj_09 obj_07)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_07)
   goals met: 0 of 1
8. (op_4 obj_07 obj_12 obj_02)
   deleted: (pred_8 obj_02) (pred_2 obj_12 obj_07)
   added: (pred_8 obj_12) (pred_2 obj_02 obj_07)
   goals met: 1 of 1
